package main

// goroutine是由Go运行时管理的用户层轻量级线程
// goroutine的调度模型及演进过程
// 1、G-M模型：限制了Go并发程序的伸缩性，主要是以下几个方面
// 1-1、单一全局互斥锁和集中状态存储的存在导致所有goroutine相关操作（如创建、重新调度等）都要上锁
// 1-2、gotoutine传递问题，经常在M之间传递“可运行的”goroutine会导致调度延迟增大，带来额外的性能损耗
// 1-3、每个M都做内存缓存，导致内存占用过高，数据局部性较差
// 1-4、因系统调用（syscall）而形成的频繁的工作线程阻塞和接触阻塞会带来额外的性能损耗

// 2、G-P-M模型 work stealing算法
// P是一个“逻辑处理器”，每个G要想真正运行起来，首先需要被分配
// 一个P，即进入P的本地运行队列（local runq）中，这里暂忽略全局运
// 行队列（global runq）那个环节。对于G来说，P就是运行它的“CPU”，
// 可以说在G的眼里只有P。但从goroutine调度器的视角来看，真正
// 的“CPU”是M，只有将P和M绑定才能让P的本地运行队列中的G真正运行
// 起来。这样的P与M的关系就好比Linux操作系统调度层面用户线程
// （user thread）与内核线程（kernel thread）的对应关系：多对多
// （N:M）

// 3、抢占式调度
// 解决一旦某个G中出现死循环的代码逻辑，那么G将永久占用分配给它的P和M，而位于同一个P中的其他G将得不到调度，出现饿死的情况，更严重只有一个P时，去他程序G都会饿死的问题
// 抢占式调度原理是在每个函数或方法的入口加上一段额外的代码，让运行时有机会检查是否需要执行抢占调度。这种协作式抢占调度的解决方案只是局部解决了饿死问题，对于没有函数调用而是纯算法循环计算的G，goroutine调度器依然无法抢占

// 4、NUMA调度模型 - 至今没有被列入开发计划

// 对goroutine调度器原理的进一步理解
// 1、G/P/M
// G：代表goroutine，存储了goroutine的执行栈信息、goroutine状态及goroutine的任务函数等。另外G对象是可以重用的
// P：代表逻辑processor，P的数量决定了系统内最大可并行G的数量，P中最有用的是其拥有的各种G对象队列、链表、一些缓存和状态
// M：M代表着真正的执行计算资源。在绑定有效的P后，进入一个调度循环；而调度循环的机制大致是从各种队列、P的本地运行队列中获取G，切换到G的执行栈上并执行G的函数，调用goexit做清理工作并回到M。如此反复。M不保留G状态，这是G可以跨M调度的基础

// $GOROOT/src/runtime/runtime2.go
// type g struct {
// stack stack
// sched gobuf
// goid int64
// gopc uintptr
// startpc uintptr
// ...
// }
// type p struct {
// lock mutex
// id int32
// status uint32
// mcache *mcache
// racectx uintptr
// // 处于可运行状态的goroutine队列，访问队列无须加锁
// runqhead uint32
// runqtail uint32
// runq [256]guintptr
// runnext guintptr
// // 可重用的G (状态 == Gdead)
// gfree *g
// gfreecnt int32
// ...
// }
// type m struct {
// g0 *g
// mstartfn func()
// curg *g
// ...
// }

// 2、G是被抢占调度
// M是如何让G停下来并调度下一个可运行的G的呢? 答案是：G是被抢占调度的
// 一旦G的抢占标志位被设为
// true，那么在这个G下一次调用函数或方法时，运行时便可以将G抢占并
// 移出运行状态，放入P的本地运行队列中（如果P的本地运行队列已满，
// 那么将放在全局运行队列中），等待下一次被调度

// 3. channel阻塞或网络I/O情况下的调度
// 如果G被阻塞在某个channel操作或网络I/O操作上，那么G会被放置
// 到某个等待队列中，而M会尝试运行P的下一个可运行的G。如果此时P
// 没有可运行的G供M运行，那么M将解绑P，并进入挂起状态。当I/O操
// 作完成或channel操作完成，在等待队列中的G会被唤醒，标记为
// runnable（可运行），并被放入某个P的队列中，绑定一个M后继续执
// 行。

// 4. 系统调用阻塞情况下的调度
// 如果G被阻塞在某个系统调用上，那么不仅G会阻塞，执行该G的M
// 也会解绑P（实质是被sysmon抢走了），与G一起进入阻塞状态。如果
// 此时有空闲的M，则P会与其绑定并继续执行其他G；如果没有空闲的
// M，但仍然有其他G要执行，那么就会创建一个新M（线程）。当系统
// 调用返回后，阻塞在该系统调用上的G会尝试获取一个可用的P，如果有
// 可用P，之前运行该G的M将绑定P继续运行G；如果没有可用的P，那么
// G与M之间的关联将解除，同时G会被标记为runnable，放入全局的运行
// 队列中，等待调度器的再次调度

func main() {

}
