package main

// 错误的四种处理策略
// 1、透明错误处理策略
// 在这种策略小由于错误处理方并不关心错误值的上下文，因此错误值的构造方可以直接使用Go标准库提供的两个基本错误值构造方法errors.New和fmt.Errorf构造错误值。这样构造出的错误值对错误处理方是透明的，因此这种策略被称为透明错误处理策略

// func doSomething(...) error {
// 	...
// 	return errors.New("some error occurred")
// }

// 2、哨兵错误处理策略 可以用GO自带的IS
// 3、错误值类型检视策略 GO自带的As去判断
// 4、错误行为特征检视策略

func main() {

	// 	尽量使用透明错误处理策略降低错误处理方与错误值构造
	// 方之间的耦合；
	// 如果可以通过错误值类型的特征进行错误检视，那么尽量
	// 使用错误行为特征检视策略；
	// 在上述两种策略无法实施的情况下，再用“哨兵”策略和错
	// 误值类型检视策略；
	// 在Go 1.13及后续版本中，尽量用errors.Is和errors.As方法
	// 替换原先的错误检视比较语句。

	// panic的典型应用
	// 1、充当断言角色，提示潜在bug
	// 2、用于简化错误处理控制结构
	// 3、使用recover捕获panic，防止goroutine意外退出
}
