package main

// 关键字 receiver       方法名            参数列表                  返回值列表
// func (srv *Server) ListenAndServerTLS(certFile, keyFile string) error {}
// 在Go中，每个方法必须归属于一个特定的类型，而receiver参数的类型就是这个方法归属的类型，每个方法只能有一个receiver参数
// 方法 receiver参数、函数/方法参数以及返回值变量对应的作用域范围，都是函数/方法体对应的显示代码块
// 这就意味着receiver部分的参数名不能与方法参数列表中的形参名或具名返回值中的变量名发生冲突 总之取不一样的名就行
// receiver 参数的基类型不能是指针类型或接口类型
// Go还要求方法声明必须与receiver参数的基类型声明放在同一个包内，基于这个约束，可以得到两个推论
// 1、不能为原生类型（如int、float64、map等）添加方法
// 2、不能跨越Go包边界为其他包的类型声明新方法

type T struct {
	a int
}

func (t T) M1() {
	t.a = 10
}

func (t *T) M2() {
	t.a = 11
}

// 选择receiver参数类型的原则
// 第一原则：如果Go方法需要将对receiver参数所代表的类型实例的修改反映到原始类型实例上，那么应该选择*T作为receiver参数的类型
// 无论是T类型还是*T类型的实例，都可以调用receiver参数类型为T的方法以及receiver参数类型为*T的方法
// 第二原则：如果 receiver 参数类型的大小较大，以值传递的形式传入方法可能会导致较大的性能开销，这时选择 *T 作为 receiver 类型可能更好；
// 如果 receiver 参数的基类型中包含不支持复制的类型（如 sync.Mutex），那么必须使用 *T 作为receiver 参数的类型。
// 这是因为尝试复制这些不可复制的类型时会导致编译器错误
// 第三原则：如果T类型需要实现某个接口，就将T作为receiver参数的类型，以确保满足接口类型方法集合中的所有方法
// 如果T类型不需要实现某一接口，但*T需要实现该接口，那么根据方法集合的概念，*T的方法集合是包含T的方法的集合的，这种情况下，当确定Go方法的receiver参数类型时，只需要参考第一原则和第二原则即可

// 方法集合 方法集合不仅可以帮助我们判断一个类型是否实现了某个接口类型，而且是判断的唯一手段，可以说，方法集合决定了接口实现
// 方法集合时Go类型中的一个属性，但不是所有类型都定义了方法，对于没有定义任何方法的类型，我们称它们拥有空方法集合
// 接口类型相对特殊，它只列出代表接口的方法列表，而不具体实现这些方法。接口的方法集合就是它的方法列表中的所有方法
// 对于非接口类型，Go规定：*T类型的方法集合包含所有以*T为receiver参数类型的方法，以及所有以T为receiver参数类型的方法
// 方法集合决定接口实现的含义是：如果某类型 T 的方法集合与某接口类型I 的方法集合相同，或者类型 T 的方法集合是接口类型 I 方法集合的超集，则认为类型 T 实现了接口 I。或者说，在 Go 中，方法集合主要用于判断某个类型是否实现了某个接口

// 类型嵌入实现继承
type E interface {
	M1()
	M2()
}

// 新接口类型 I 不仅包含自己的 M3 方法，还将嵌入的接口类型 E 的 M1 和 M2 方法纳入其方法集合中
type I interface {
	E
	M3()
}

// 结构体类型的嵌入则是通过将某个类型名、类型的指针类型名或接口类型名直接作为结构体字段的方式实现，这些字段也被称为嵌入字段（embedded field）。结构体类型会“继承”这些嵌入字段的方法集合。然而，这本质上是组合思想中的代理（delegate）模式的一种实现形式
// 嵌入字段类型的底层类型不能是指针类型，并且嵌入字段的名字在结构体定义中必须是唯一的

func main() {
	var t T
	println(t.a)
	t.M1()
	println(t.a)
	t.M2()
	println(t.a)
}
